app/Domain/Passenger/FlightCollisionDetector.php

select `flights`.*, `passenger_flight`.`passenger_id` as `pivot_passenger_id`, `passenger_flight`.`flight_id` as `pivot_flight_id` from `flights` inner join `passenger_flight` on `flights`.`id` = `passenger_flight`.`flight_id` where `passenger_flight`.`passenger_id` = 1
---
    public static function run(Passenger $passenger): string
    {
        $flights = $passenger->flights;
        for ($i = 0; $i < $flights->count() - 1; $i++) {